#+POSTID: 60
# # -*- org-odt-styles-file: "/home/matt/.emacs.d/Templates/RLG231Syllabus.odt"; -*-
#+OPTIONS: ':nil *:t -:t ::t <:t H:4 \n:nil arch:nil
#+OPTIONS: author:nil c:nil creator:nil d:(not "LOGBOOK") date:nil
#+OPTIONS: stat:t tags:t tasks:t tex:t timestamp:t toc:nil todo:t |:t
# #+OPTIONS: stat:t tags:t tasks:t tex:t timestamp:t toc:2 todo:t |:t
#+STARTUP: customtime entitiespretty
#+TITLE: Syllabus
#+SUBTITLE: HIS393: Digital History, Fall 2019
#+AUTHOR: Matt Price
#+EMAIL: matt.price@utoronto.ca
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE: en
# #+ODT_STYLES_FILE: "/home/matt/.emacs.d/Templates/New113Syllabus.odt"
#+ODT_STYLES_FILE: "/home/matt/.emacs.d/Templates/syl-temp-2019.odt"
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+CREATOR: Emacs 27.0.5 (Org mode 9.1.4)
#+HUGO_BASE_DIR: ./dh-website/
#+HUGO_SECTION: syllabus
#+HUGO_STATIC_IMAGES: images
#+HUGO_MENU: :menu main :weight 10
#+HUGO_CUSTOM_FRONT_MATTER: :banner "testbanner"
# #+MACRO: ts (eval (get-ts+7-inc-ov 1))
#+MACRO: ts (eval(mwp-get-ts+7  'org-mwp-classtimes-calibrate 2))
#+OPTIONS: todo:nil
#+ORG_LMS_COURSEID: 123949
#+ORG_LMS_ASSIGNMENTS: ~/DH/Assignments.org
#+IS_PUBLIC: nil


* COMMENT Variables
#+begin_src emacs-lisp
(make-local-variable 'org-use-property-inheritance)
(setq org-use-property-inheritance nil)
(setq org-lms-baseurl "https://q.utoronto.ca/api/v1/")
(setq org-lms-token (password-store-get "q.utoronto.ca"))
;;(org-lms-set-keyword "ORG_LMS_COURSEID" 64706)

(org-lms-setup)
#+end_src

#+begin_src emacs-lisp
(setq org-odt-styles-file "/home/matt/.emacs.d/Templates/syl-temp-2019.odt")
#+end_src

#+RESULTS:
: /home/matt/.emacs.d/Templates/syl-temp-2019.odt

local variables need to be set at the end of the file.  
# Local Variables:
# org-time-stamp-custom-formats: ("<%b. %d>" . "<%Y-%m-%d %H:%M>")
# org-mwp-classtimes-calibrate: ("<2019-09-03 Tue>" "<2019-08-29 Thu>" )
# End:  
